<!-- dflook/terraform-github-actions {"workspace":"default","backend_type":"s3","label":"dev","backend":"1fc265a63a978b806c8136e70953fe63422e707bb26692fba2e3c24770572d52","plan_job_ref":"Job Pull Request Checks #1977 at https://github.com/GSA-TTS/FAC/actions/runs/7281104312","plan_hash":"c6aea684c08d2d03538407b62c2a31a2eb2604796e7b7100505f4d4c64d37bab","plan_text_format":"text","version":"1.38.0"} -->
Terraform plan for __dev__
<details>
<summary>Plan: 8 to add, 1 to change, 0 to destroy.</summary>

```hcl
Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  ~ update in-place

Terraform will perform the following actions:

  # module.dev.cloudfoundry_network_policy.logshipper-network-policy will be created
  + resource "cloudfoundry_network_policy" "logshipper-network-policy" {
      + id = (known after apply)

      + policy {
          + destination_app = "a6eb3870-2769-4aa9-a8f2-f1a31939f563"
          + port            = "61443"
          + protocol        = "tcp"
          + source_app      = (known after apply)
        }
    }

  # module.dev.cloudfoundry_user_provided_service.credentials will be updated in-place
  ~ resource "cloudfoundry_user_provided_service" "credentials" {
      ~ credentials = (sensitive value)
        id          = "03df74b7-065a-46df-9a85-0bac201bf36c"
        name        = "newrelic-creds"
      ~ tags        = [
          + "newrelic-creds",
        ]
        # (1 unchanged attribute hidden)
    }

  # module.dev.module.cg-logshipper.cloudfoundry_app.cg_logshipper_app will be created
  + resource "cloudfoundry_app" "cg_logshipper_app" {
      + buildpack                       = (known after apply)
      + buildpacks                      = [
          + "https://github.com/cloudfoundry/apt-buildpack",
          + "nginx_buildpack",
        ]
      + disk_quota                      = 256
      + enable_ssh                      = (known after apply)
      + environment                     = (sensitive value)
      + health_check_http_endpoint      = (known after apply)
      + health_check_invocation_timeout = (known after apply)
      + health_check_timeout            = (known after apply)
      + health_check_type               = "process"
      + id                              = (known after apply)
      + id_bg                           = (known after apply)
      + instances                       = 1
      + memory                          = 256
      + name                            = "logshipper"
      + path                            = "../shared/modules/cg-logshipper/logshipper.zip"
      + ports                           = (known after apply)
      + source_code_hash                = "8e31ec8f5c1d7b76111dcede270080a0524b74933b92a626887ae54fea7e2d0d"
      + space                           = "06525ba3-19c2-451b-96e9-ea4a9134e8b9"
      + stack                           = (known after apply)
      + stopped                         = false
      + strategy                        = "rolling"
      + timeout                         = 180

      + routes {
          + port  = (known after apply)
          + route = (known after apply)
        }

      + service_binding {
          + service_instance = "03df74b7-065a-46df-9a85-0bac201bf36c"
        }
      + service_binding {
          + service_instance = (known after apply)
        }
      + service_binding {
          + service_instance = (known after apply)
        }
    }

  # module.dev.module.cg-logshipper.cloudfoundry_route.logshipper will be created
  + resource "cloudfoundry_route" "logshipper" {
      + domain   = "50ba3f69-cd54-4963-9172-14f3334b479e"
      + endpoint = (known after apply)
      + hostname = "fac-dev-logshipper"
      + id       = (known after apply)
      + port     = (known after apply)
      + space    = "06525ba3-19c2-451b-96e9-ea4a9134e8b9"
    }

  # module.dev.module.cg-logshipper.cloudfoundry_user_provided_service.logdrain_service will be created
  + resource "cloudfoundry_user_provided_service" "logdrain_service" {
      + id               = (known after apply)
      + name             = "fac-logdrain"
      + space            = "06525ba3-19c2-451b-96e9-ea4a9134e8b9"
      + syslog_drain_url = (sensitive value)
    }

  # module.dev.module.cg-logshipper.cloudfoundry_user_provided_service.logshipper_creds will be created
  + resource "cloudfoundry_user_provided_service" "logshipper_creds" {
      + credentials = (sensitive value)
      + id          = (known after apply)
      + name        = "cg-logshipper-creds"
      + space       = "06525ba3-19c2-451b-96e9-ea4a9134e8b9"
      + tags        = [
          + "logshipper-creds",
        ]
    }

  # module.dev.module.cg-logshipper.random_password.password will be created
  + resource "random_password" "password" {
      + bcrypt_hash = (sensitive value)
      + id          = (known after apply)
      + length      = 16
      + lower       = true
      + min_lower   = 0
      + min_numeric = 0
      + min_special = 0
      + min_upper   = 0
      + number      = true
      + numeric     = true
      + result      = (sensitive value)
      + special     = false
      + upper       = true
    }

  # module.dev.module.cg-logshipper.random_uuid.username will be created
  + resource "random_uuid" "username" {
      + id     = (known after apply)
      + result = (known after apply)
    }

  # module.dev.module.cg-logshipper.module.s3-logshipper-storage.cloudfoundry_service_instance.bucket will be created
  + resource "cloudfoundry_service_instance" "bucket" {
      + id                             = (known after apply)
      + name                           = "log-storage"
      + replace_on_params_change       = false
      + replace_on_service_plan_change = false
      + service_plan                   = "021bb2a3-7e11-4fc2-b06b-d9f5938cd806"
      + space                          = "06525ba3-19c2-451b-96e9-ea4a9134e8b9"
      + tags                           = [
          + "logshipper-s3",
        ]
    }

Plan: 8 to add, 1 to change, 0 to destroy.

Warning: Argument is deprecated

  with module.dev.module.cg-logshipper.module.s3-logshipper-storage.cloudfoundry_service_instance.bucket,
  on /tmp/terraform-data-dir/modules/dev.cg-logshipper.s3-logshipper-storage/s3/main.tf line 14, in resource "cloudfoundry_service_instance" "bucket":
  14:   recursive_delete = var.recursive_delete

Since CF API v3, recursive delete is always done on the cloudcontroller side.
This will be removed in future releases

(and 5 more similar warnings elsewhere)
```
</details>

:memo: Plan generated in [Pull Request Checks #1977](https://github.com/GSA-TTS/FAC/actions/runs/7281104312)